Revit 2026 API

# SketchEditScopeIsSketchEditingSupported Method

---

Checks whether sketch can be edited.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsSketchEditingSupported(
	ElementId sketchId
)
```
```vb
Public Function IsSketchEditingSupported (
	sketchId As ElementId
) As Boolean
```
```cpp
public:
bool IsSketchEditingSupported(
	ElementId^ sketchId
)
```
```fsharp
member IsSketchEditingSupported :
        sketchId : ElementId -> bool
```

#### Parameters

sketchId ElementId
     The element id of sketch.

#### Return Value

Boolean True if sketch can be edited, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This method checks if this particular sketch can be edited. If you want to check if all sketches of an element can be edited please use IsSketchEditingSupportedForSketchBasedElement(ElementId)

#### Reference

SketchEditScope Class

Autodesk.Revit.DB Namespace